app/views/messages/index.html.erb

SELECT "messages".* FROM "messages" WHERE (delflg = 0) ORDER BY id desc
---
			<!-- Error Area Start -->
			<% errors = flash[:message].errors if flash[:message].present? %>