app/controllers/messages_controller.rb

  def index

    @messages = Message.where(:delflg => false).page(params[:page])
---
SELECT "messages".* FROM "messages" WHERE "messages"."delflg" = 'f' ORDER BY no desc LIMIT 10 OFFSET 0
SELECT COUNT(*) FROM "messages" WHERE "messages"."delflg" = 'f'

  def create

    message = Message.new(params[:message])
    message.pwd = message.pwd.present? ? Message.fake_encrpt(message.pwd) : message.pwd
    message.sub = Message::NO_SUB if message.sub.blank?
	message.host = request.remote_addr
	message.delflg = false
	message.no = Message.max_no

    if message.save
---
INSERT INTO "messages" ("comment", "created_at", "delflg", "email", "host", "name", "no", "pwd", "sub", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

  def destroy

    Message.transaction do

      # SQLLiteだとfor updateできない→TODO max_noの一意性の確保（未検討）
      message = Message.find(:first, :conditions => {:delflg => false, :no =>params[:message]["no"]}, :lock => true)
      Message.update(message.id, :delflg => true, :no => nil)
---
SELECT "messages".* FROM "messages" WHERE "messages"."delflg" = 'f' AND "messages"."no" = 26 ORDER BY no desc LIMIT 1
UPDATE "messages" SET "delflg" = 't', "no" = NULL, "updated_at" = '2012-10-05 02:33:24.506101' WHERE "messages"."id" = 47

  def show

    @message = Message.find(params[:id])
---
SELECT "messages".* FROM "messages" WHERE "messages"."id" = ? ORDER BY no desc LIMIT 1  [["id", "43"]]